backend/app/controllers/students_controller.rb

    def create
    student = Student.create(user_params)
---
INSERT INTO "students" ("name", "test_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Joe"], ["test_id", 3], ["created_at", "2018-12-20 19:00:30.928563"], ["updated_at", "2018-12-20 19:00:30.928563"]]