backend/app/controllers/teachers_controller.rb

INSERT INTO "teachers" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "test"], ["created_at", "2018-12-20 01:04:32.137616"], ["updated_at", "2018-12-20 01:04:32.137616"]]
---
    def create
      teacher = Teacher.create(user_params)

SELECT  "teachers".* FROM "teachers" WHERE "teachers"."name" = $1 LIMIT $2  [["name", "Testme"], ["LIMIT", 1]]
---
    def show
      name = params[:id]
      teacher = Teacher.find_by(name: params[:id])