backend/app/controllers/tests_controller.rb

INSERT INTO "tests" ("name", "teacher_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "9c65rf"], ["teacher_id", 31], ["created_at", "2018-12-20 16:28:00.376674"], ["updated_at", "2018-12-20 16:28:00.376674"]]
---
  def create
    test = Test.create(user_params)

SELECT  "tests".* FROM "tests" WHERE "tests"."name" = $1 LIMIT $2  [["name", "iaawz"], ["LIMIT", 1]]
---
  def show
    @test = Test.find_by(name: params[:id])

SELECT  "tests".* FROM "tests" WHERE "tests"."name" = $1 LIMIT $2  [["name", "5zxstsc"], ["LIMIT", 1]]
---
    def show
      @test = Test.find_by(name: params[:id])