backend/app/channels/students_channel.rb

  def subscribed
    # stream_from "some_channel"
    ## Changed find_by(id: ...) to find_by(name: ...) allows individual
    ## channels
    @student = Student.find_by(name: params[:name])
---
SELECT  "students".* FROM "students" WHERE "students"."name" = $1 LIMIT $2  [["name", "joey"], ["LIMIT", 1]]

  def question_send(data)
    next_question = Question.where(category: data["category"]).where(level: data["level"]).where(round: data["round"])
---
SELECT "questions".* FROM "questions" WHERE "questions"."category_id" = $1 AND "questions"."level" = $2 AND "questions"."round" = $3  [["category_id", 1], ["level", 2], ["round", 1]]