backend/app/channels/students_channel.rb

  def subscribed
    # stream_from "some_channel"
    @student = Student.find_by(id: params[:name])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]